Revit 2027 API
LinkOperations Methods
The LinkOperations type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetOnLocalLinkSharedCoordinatesSavedCallback |  Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
LinkOperations Class
Autodesk.Revit.DB Namespace